deasy/Tsung/load_test1.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="http://ec2-44-227-243-49.us-west-2.compute.amazonaws.com/" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="1000" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="minute">
      <users arrivalrate="2000" unit="second"></users>
    </arrivalphase>

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

<!--Scenario: Log in ->  choose a Res, sort_by: rate, city: Los Angeles -> signout-->

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
        <transaction name="search_places">
          <request>
            <http url="/signin" method="POST" version="1.1" contents="session[email]=ali@gamil.com&amp;session[password]=foobar1&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
          </request>

          <request>
            <http url="/" method="POST" version="1.1" contents="search=Bar&amp;city=Los Angeles&amp;sortCat=Rating&amp;car[color]=Red&amp;car[license_plate]=1234567&amp;car[all_tags]=trendy&amp;commit=Search"/>
          </request>

          <request>
            <http url="/signout" method="DELETE" version="1.1" />
          </request>

        </transaction>
    </session>
  </sessions>
</tsung>