deasy/Tsung/load_test1.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='2000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="ec2-44-228-116-248.us-west-2.compute.amazonaws.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="2" unit="minute">
      <users arrivalrate="3" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

<!--Scenario: Log in ->  search for Bar, sort_by: Rating, city: Los Angeles -> signout -->

  <sessions>
    <session name="search_places" probability="100" type="ts_http">
        <setdynvars sourcetype="random_number" start="1" end="1000">
            <var name="id" />
        </setdynvars>
        <request>
            <http url='/' version='1.1' method='GET'></http>
         </request>
       <!-- Get the sign in  page-->
        <request subst="true">
            <http url='/users/sign_in' version='1.1' method='POST'
            content_type='application/x-www-form-urlencoded'
            contents='user%5Bemail%5D=email%%_id%%@deazy.com&amp;user%5Bpassword%5D=seedaccount'></http>
        </request>
        <!--sign up-->
        <request subst="true">
          <http url="/users/sign_up" method="POST" version="1.1" contents="user[email]=j%%_counter%%@gmail.com&amp;user[password]=foobar1&amp;user[password_confirmation]=foobar1&amp;commit=Sign up" content_type="application/x-www-form-urlencoded" />
        </request>
        <!-- wait for up to 2 seconds, user is fillinf in new submission form -->
      <thinktime value="2" random="true"></thinktime> -->
          <request>
            <http url="/signin" method="POST" version="1.1" contents="resource[email]=ali@gmail.com&amp;resource[password]=foobar1&amp;commit=Log in" content_type="application/x-www-form-urlencoded" />
          </request>

          <request>
            <http url="/" method="POST" version="1.1" contents="search=Bar&amp;city=Los Angeles&amp;sortCat=Rating&amp;commit=Search"/>
          </request> 
        <!-- wait for up to 2 seconds, user decides to delete submission -->
      <thinktime value="2" random="true"></thinktime>
        <request>
            <http url='/users/sign_out' version='1.1' method='DELETE'></http>
        </request>

    </session>
  </sessions>
</tsung>